print("Введите радиус круга в сантиметрах:")
p = input()
str(p)
print("Длина окружности в сантиметрах:", str(3,14*(2*int(p))))

print("Длина окружности в метрах:", str((3,14*(2*int(p))))/100)

print("Площадь круга в сантиметрах:", str(3,14*(int(p)*int(p))))

print("Площадь круга в метрах:", str(3,14*(int(p)*int(p)))/100)

print("Сторона вписанного квадрата:", str(int(p)*1.42))

print("Сторона равностороннего треугольника:", str(int(p)*1.73))

print("Сторона описанного квадрата:", str(2*int(p)))

print("Сторона описанного треугольника:", str(int(p)/0.58))

print("Сторона описанного восьмиугольника:", str(2*int(p)*0.56))
